{
  "headerData": {
    "logoDark": "/images/newChLogo.webp"
  },
  "heroData": {
    "title": "It’s me the <span><br />Cyber security...</span><br/>guy",
    "subTitle": "I am <span>Nithinbharathi</span>",
    "ImgLink": "/images/home-banner.webp",
    "phone": "+91 6369 601050",
    "email": "nithinthelordest@gmail.com",
    "btnText": "Work with me",
    "socialData": [
      {
        "link": "https://www.linkedin.com/in/nithinbharathi/",
        "icon": "linkedin"
      },
      {
        "link": "https://github.com/Nithinbharathi93/",
        "icon": "github"
      },
      {
        "link": "mainto:nithinthelordest@gmail.com",
        "icon": "google"
      }
    ]
  },
  "aboutData": {
    "aboutLeft": {
      "ImgLink": "/images/about-banner.webp",
      "name": "Nithinbharathi",
      "designation": "<span>I am that</span> Cybersecurity <span>guy</span>",
      "resumeCv": "/Resume.pdf"
    },
    "aboutRight": {
      "aboutText": "I’m a passionate cybersecurity enthusiast and full-stack developer based in Coimbatore, India. I create secure, efficient, and innovative tech solutions — from offensive security tools to real-world web apps.",
      "contactInfo": [
        {
          "icon": "phone",
          "data": "+91 6369 601050"
        },
        {
          "icon": "github",
          "data": "Nithinbharathi93"
        },
        {
          "icon": "envelope",
          "data": "nithinthelordest@gmail.com"
        },
        {
          "icon": "map",
          "data": "Coimbatore, India"
        }
      ],
      "archivement": [
        {
          "number": "20+",
          "meta": "Projects <br /> completed...",
          "text": "I have been with computers since my early childhood. Thus I extend my experties in cybersecurity, web development, and Networking."
        },
        {
          "number": "250+",
          "meta": "Students <br /> trained...",
          "text": "With over 2 years of experience —  from a trainee to team lead, I have acquired the skills to make your project a success."
        }
      ],
      "note": "“Security isn’t a product — it’s a mindset. I build software with protection and privacy at its core.”"
    }
  },

  "experienceData": {
    "text": "Hello there! My o  verall journey is keenly foused on a collaborative development mindset. Through out my academics and career, I tend to educate and learn crucial nuances from people around me.",
    "resumeCv": "/Resume.pdf",
    "education": [
      {
        "start": "2022",
        "end": "2025",
        "score": "8.86 GPA",
        "title": "BE Computer Science & Engineering",
        "subtitle": "SNS College of Technology",
        "description": "Pursuing a comprehensive curriculum covering programming, data structures, networking, cybersecurity, and full-stack development. Completed several hands-on projects in ethical hacking and secure web development."
      },
      {
        "start": "2021",
        "end": "2022",
        "score": "92.2%",
        "title": "Grade 12",
        "subtitle": "Agaram Public School",
        "description": "Studied Physics, Chemistry, Mathematics, and Computer Science with a focus on logic building and software fundamentals. Developed basic web applications as early projects."
      },
      {
        "start": "2019",
        "end": "2020",
        "score": "81.1%",
        "title": "Grade 10",
        "subtitle": "Greenfield International School",
        "description": "Laid strong foundations in general sciences and computer basics. Actively participated in school-level tech expos and coding contests."
      }
    ],
    "experience": [
      {
        "start": "Nov 2024",
        "end": "Present",
        "title": "Team Lead",
        "subtitle": "Techsnapie Solutions",
        "description": "Managing a cross-functional team to deliver secure and scalable web applications. Mentoring junior developers and overseeing code reviews and agile planning."
      },
      {
        "start": "Jul 2023",
        "end": "Nov 2024",
        "title": "Web Developer",
        "subtitle": "Techsnapie Solutions",
        "description": "Developed and deployed responsive web platforms using MERN stack. Integrated APIs, handled performance tuning, and ensured compliance with security practices."
      },
      {
        "start": "Jan 2025",
        "end": "Feb 2025",
        "title": "Cybersecurity Intern",
        "subtitle": "IBM & Edunet",
        "description": "Engaged in practical cybersecurity training including threat modeling, cryptographic methods, steganography, and vulnerability assessment using real-world simulations."
      },
      {
        "start": "Oct 2024",
        "end": "May 2025",
        "title": "All Avenue Director",
        "subtitle": "Rotaract Club of SNSCT",
        "description": "Coordinated and led community service and professional development events. Oversaw activities across multiple avenues including public relations, digital operations, and member engagement."
      }
    ],
    "pastRoles": [
      {
        "start": "Mar 2025",
        "end": "Apr 2025",
        "title": "Campus Coordinator",
        "subtitle": "SNS Dt Team",
        "description": "Handled more than 150 students and helped them develop a habit to work on leetcode. This session allowed the student to come up with their hidden coding skills"
      },
      {
        "start": "Oct 2024",
        "end": "May 2025",
        "title": "Joint Secretary",
        "subtitle": "Xenix Association",
        "description": "Organized technical workshops and seminars on emerging technologies. Handled planning, speaker invitations, and content design for cybersecurity and development topics."
      },
      {
        "start": "Nov 2023",
        "end": "Oct 2024",
        "title": "Executive Member",
        "subtitle": "Rotaract Club of SNSCT",
        "description": "Assisted in planning social impact events, handled digital promotions, and improved club outreach. Played a key role in event logistics and technical execution."
      },
      {
        "start": "July 2023",
        "end": "June 2024",
        "title": "Organizing Committee Member",
        "subtitle": "SNS IMUN Club",
        "description": "Helped plan and execute Model United Nations conferences. Managed delegate coordination, website content, and digital communication."
      }
    ]
  },



  "serviceData": [
    {
      "title": "Frontend Engineering",
      "heading": "Responsive and interactive UI development using ReactJS & modern frameworks.",
      "triger": "One",
      "imgLink": "/images/services-1.webp",
      "text": "I craft sleek, accessible, and interactive interfaces using ReactJS, Tailwind CSS, Material UI, and Flet. From single-page applications to component-driven design systems, I focus on building dynamic user experiences with modern JavaScript libraries."
    },
    {
      "title": "Backend Development",
      "heading": "Robust backend systems and scalable APIs with Node.js and MongoDB.",
      "triger": "Two",
      "imgLink": "/images/services-2.webp",
      "text": "I architect RESTful and event-driven backends using Node.js, Express, and MongoDB. My services include authentication systems, real-time sockets, role-based access controls, and cloud-ready backend APIs for web and mobile platforms."
    },
    {
      "title": "API Integration & Workflows",
      "heading": "Seamless API integration and automation using third-party services & n8n.",
      "triger": "Three",
      "imgLink": "/images/services-3.webp",
      "text": "I specialize in integrating services like Google Sheets API, Gemini, and Deepgram into custom applications. I also build low-code automation flows using n8n for handling webhooks, syncing data, and triggering actions across platforms efficiently."
    },
    {
      "title": "Cybersecurity & Pentesting",
      "heading": "Offensive security, custom tools, and vulnerability assessments.",
      "triger": "Four",
      "imgLink": "/images/services-4.webp",
      "text": "With a strong foundation in ethical hacking and red teaming, I develop and use custom security tools for network and application-level testing. I also conduct CTFs, teach infosec fundamentals, and support secure software development lifecycles."
    },
    {
      "title": "Automation & Custom Tooling",
      "heading": "Developer tools and offensive security utilities for real-world needs.",
      "triger": "Five",
      "imgLink": "/images/services-5.webp",
      "text": "I build CLI and GUI tools to simplify workflows — from steganography-based communication tools to admin dashboards and recon scripts. These tools enhance productivity in security audits, devops, and data collection pipelines."
    }
  ],

"portfolioData": [
  {
    "ImgLink": "/images/proj-1.webp",
    "title": "P2Peek",
    "link": "https://github.com/your-username/p2peek",
    "subTitle": "Flagship | Communication Platform",
    "paragraphList": [
      { "text": "P2Peek is a peer-to-peer communication application with built-in steganography and encryption, offering a secure alternative to traditional chat apps." },
      { "text": "Messages can be embedded inside image containers using LSB steganography, and the resulting image is encrypted before transmission." },
      { "text": "Includes features like user whitelisting, blacklisting, profile-based access control, and an admin dashboard for session monitoring." },
      { "text": "Developed using Python for backend logic and WebSockets for real-time communication. Available in both native and web formats." }
    ]
  },
  {
    "ImgLink": "/images/proj-2.webp",
    "title": "Phishing Link Finder",
    "link": "https://github.com/your-username/phishing-link-finder",
    "subTitle": "Defensive Security Tool",
    "paragraphList": [
      { "text": "Phishing Link Finder is a cybersecurity tool designed to detect and flag potential phishing URLs in real-time using heuristic patterns and URL analysis." },
      { "text": "It incorporates blacklisted domain checks, fuzzy matching with known phishing domains, and detection of suspicious URL encoding techniques." },
      { "text": "This tool is ideal for security analysts and email gateways to pre-scan links in inbound messages, significantly reducing the risk of social engineering attacks." },
      { "text": "Built with Python and Flask for the backend API and uses a custom-trained machine learning model for enhanced phishing probability scoring." }
    ]
  },
  {
    "ImgLink": "/images/proj-3.webp",
    "title": "Subdomain Finder",
    "link": "https://github.com/your-username/subdomain-finder",
    "subTitle": "Offensive Security Tool",
    "paragraphList": [
      { "text": "Subdomain Finder is a reconnaissance tool that helps ethical hackers discover hidden or forgotten subdomains of a given domain." },
      { "text": "It scrapes data from multiple open-source intelligence (OSINT) sources like crt.sh, VirusTotal, and DNSDumpster, and also supports brute-force mode." },
      { "text": "Designed for pentesters and bug bounty hunters, this tool assists in uncovering potential attack surfaces during security assessments." },
      { "text": "Built in Python with asynchronous requests to achieve fast enumeration, it also supports output in CSV/JSON format for integration with other tools." }
    ]
  },
  {
    "ImgLink": "/images/proj-4.webp",
    "title": "AI Integrated Transcriber",
    "link": "https://github.com/your-username/ai-transcriber",
    "subTitle": "Everyday Assist",
    "paragraphList": [
      { "text": "An AI-powered transcriber that converts speech to text in real-time, optimized for meetings, lectures, and interviews." },
      { "text": "Integrates Whisper by OpenAI for high-accuracy speech recognition, with support for multiple languages and dialects." },
      { "text": "The tool can automatically detect speakers, remove filler words, and generate clean, timestamped transcripts." },
      { "text": "Supports upload of audio files or live microphone input and exports transcripts in DOCX, TXT, and PDF formats." }
    ]
  },
  {
  "ImgLink": "/images/proj-5.webp",
  "title": "Medical Coding Assistant",
  "link": "https://github.com/Nithinbharathi93/medical-coding-assist",
  "subTitle": "Healthcare AI Utility",
  "paragraphList": [
    { "text": "A Gemini-powered AI tool that automates medical coding from clinical scenarios, extracting ICD-10-CM, CPT, and HCPCS codes." },
    { "text": "Users enter patient case descriptions, and the app intelligently identifies diagnoses, procedures, and relevant medical terminology." },
    { "text": "Built with Vite + ReactJS and styled with custom components for a clean and intuitive UI." },
    { "text": "Uses Google Generative AI (Gemini Flash 2.0) to interpret natural language and return structured medical codes in JSON format." },
    { "text": "Deployed on Vercel with environmental variable protection for secure API key management." },
    { "text": "Not open source; proprietary solution aimed at supporting medical coders, practitioners, and healthcare data analysts." },
    { "text": "Live site available at: https://medical-coding-assist.vercel.app/" }
  ]
},
{
  "ImgLink": "/images/proj-6.webp",
  "title": "Secure File Upload & Malware Scanner",
  "link": "https://github.com/Nithinbharathi93/secure-file-upload",
  "subTitle": "File Security & Threat Detection",
  "paragraphList": [
    { "text": "A secure web app that scans uploaded files for malware using ClamAV antivirus engine integrated with an Express.js backend." },
    { "text": "Features a ReactJS frontend allowing users to upload files and get real-time scan results with an intuitive UI." },
    { "text": "Backend is containerized with Docker, ensuring easy deployment and isolated ClamAV scanning environment." },
    { "text": "Designed for quick detection of malicious files to protect systems from potential threats during file uploads." }
  ]
},
{
  "ImgLink": "/images/proj-7.webp",
  "title": "Sustainable EV Optimizer",
  "link": "https://github.com/Nithinbharathi93/SustainableEV",
  "subTitle": "Route and Battery Intelligence for Electric Vehicles",
  "paragraphList": [
    { "text": "SustainableEV is an intelligent EV travel assistant designed to deliver practical, real-time, and data-driven recommendations based on current battery percentage, weather, traffic conditions, and the selected route." },
    { "text": "It consumes live data through tools to provide a structured JSON output that includes route suggestions, charging advice, and optimized travel instructions—specifically crafted for EV efficiency." },
    { "text": "The assistant is strictly restricted from making assumptions and is trained to generate decisions solely based on the input JSON and real-time fetches from weather, traffic, and route services." },
    { "text": "Ideal for EV route planners, fleet managers, and sustainability-focused developers, the project is fully open-source and easy to integrate with external tools and APIs." }
  ]
}



],
  "blogData": [
  {
    "ImgLink": "/images/blog-1.webp",
    "date": "March 19, 2025",
    "delay": "700",
    "title": "CTF Challenge - Texperia 2025",
    "paragraphList": [
      { "text": "Organized a Capture The Flag (CTF) challenge during the Texperia 2025 technical event, focusing on real-world cybersecurity scenarios." },
      { "text": "The event emphasized quality participation, showcasing the problem-solving skills of upcoming ethical hackers and security enthusiasts." },
      { "text": "Contributed as part of a core team that handled challenge design, infrastructure setup, and event flow, with support from department leadership and faculty coordinators." }
    ]
  },
  {
    "ImgLink": "/images/blog-2.webp",
    "date": "April 30, 2025",
    "delay": "800",
    "title": "LeetCode Bootcamp & Peer Mentorship",
    "paragraphList": [
      { "text": "Facilitated a month-long LeetCode bootcamp involving over 150 students and 25 peer mentors from multiple departments." },
      { "text": "Focused on building consistency in problem-solving, improving algorithmic thinking, and preparing students for coding interviews." },
      { "text": "Provided hands-on training and guidance to a group of selected students who demonstrated exceptional progress throughout the bootcamp." }
    ]
  },
  {
    "ImgLink": "/images/blog-3.webp",
    "date": "April 23, 2025",
    "delay": "900",
    "title": "GenAI Bootcamp – SUSEV with n8n & Gemini",
    "paragraphList": [
      { "text": "Developed SUSEV (Smart Utility Solution for Electric Vehicles), an AI-powered workflow solution during a GenAI Bootcamp at SNS iHub." },
      { "text": "Integrated Google Gemini API with n8n for backend logic and automated decision-making; designed the frontend using ReactJS for better user experience." },
      { "text": "Worked under expert mentorship to solve an EV-focused problem statement using modern AI automation workflows." }
    ]
  }
]

,
  "sliderData": {
    "testimonialInfo": {
      "useFor": "testimonial",
      "settings": {
        "infinite": true,
        "speed": 1500,
        "autoplay": true,
        "autoplaySpeed": 5000,
        "slidesToShow": 2,
        "slidesToScroll": 1,
        "arrows": false,
        "dots": true,
        "responsive": [
          {
            "breakpoint": 991,
            "settings": {
              "slidesToShow": 1,
              "autoplay": true
            }
          }
        ]
      },
      "info": [
        {
          "imgLink": "/images/sd-pic.webp",
          "name": "Sanjaydharshan",
          "designation": "Frontend developer",
          "text": "Nithinbharathi is always a great mentor and a lovely senior I never thought work would become much easier and fun-filled days were cherishing each and every moment of me being in Techsnapie Solutions with my Brother Nithinbharathi"
        },
        {
          "imgLink": "/images/k-pic.webp",
          "name": "Karuppasamy",
          "designation": "MERN Developer",
          "text": "Working with Nithin has been an exceptional experience. His deep understanding of web technologies and his problem-solving approach consistently elevate our freelance projects. A true professional and a great teammate."
        },
        {
          "imgLink": "/images/rith-pic.webp",
          "name": "Rithish.G",
          "designation": "DevOps Engineer",
          "text": "At Techsnapie, I’ve seen him manage complex systems with ease and collaborate seamlessly across domains. His cybersecurity insights, combined with solid development skills, make him a valuable asset in any tech-driven environment."
        }
      ]
    },
    "brandInfo": {
      "useFor": "brand",
      "settings": {
        "infinite": true,
        "speed": 1000,
        "autoplay": true,
        "autoplaySpeed": 3000,
        "slidesToShow": 5,
        "slidesToScroll": 1,
        "arrows": false,
        "responsive": [
          {
            "breakpoint": 991,
            "settings": {
              "slidesToShow": 4
            }
          },
          {
            "breakpoint": 767,
            "settings": {
              "slidesToShow": 3
            }
          }
        ]
      },
      "info": [
        {
          "imgLink": "/images/brand-1.png"
        },
        {
          "imgLink": "/images/brand-2.png"
        },
        {
          "imgLink": "/images/brand-3.png"
        },
        {
          "imgLink": "/images/brand-4.png"
        },
        {
          "imgLink": "/images/brand-1.png"
        },
        {
          "imgLink": "/images/brand-2.png"
        }
      ]
    }
  },
  "contactData": {
    "contactInfo": [
      {
        "icon": "chat-left-dots-fill",
        "title": "Got a question or collaboration idea?",
        "text": "",
        "emailLink": "Send an email"
      },
      {
        "icon": "compass",
        "title": "Let’s connect! Reach out if you're nearby.",
        "text": "Coimbatore, Tamil Nadu, India – 641035"
      },
      {
        "icon": "phone",
        "title": "Available 9 AM – 6 PM (IST)",
        "text": "+91 6369 601050"
      }
    ],
    "contactForm": {
      "title": "Got Ideas? Let's Build Together.",
      "text": "Tell me what you have in mind. I’d love to hear from you."
    }
  },
  "footerData": {
    "ImgLink": "/images/about-banner.webp",
    "name": "Nithinbharathi"
  },
  "socialData": [
    {
      "icon": "instagram",
      "link": "https://www.instagram.com/nithinbharathi.t/"
    },
    {
      "icon": "linkedin",
      "link": "https://www.linkedin.com/in/nithinbharathi/"
    },
    {
      "icon": "github",
      "link": "https://github.com/Nithinbharathi93/"
    },
    {
      "icon": "google",
      "link": "mailto:nithinthelordest@gmail.com"
    }
  ]
}